{
    "pgType":"plain",
    "title":"Research on Superman",
    "body": "<strong>Solar Energy Absorption:</strong><br>Technically, this is the main source of Superman's powers. Because Superman's powers are greatly due to exposure to Earth's yellow sun, his powers have been affected by extreme absorptions of solar power, whether voluntary or involuntary. However, Superman has used this to his advantage in battle in many instances, and to his detriment at certain times.<br><strong>Superhuman Strength:</strong><br>The exact magnitude of Superman's strength is unknown. This is because Superman's strength, like his other powers, has fluctuated over time, however, his strength should effortlessly range into the multi-megaton level at the very least. While the exact magnitude of Superman's strength is unknown, it is generally accepted that his strength easily surpasses the capacity to lift 1,000,000 tons, but how much more is not known exactly. Arguably the strongest being on the planet and one of the strongest beings in the Universe. Superman has shown feats of strength such as; being seen lifting an enormous pyramid and flying it to Mars without any strain (which can weigh millions and millions of tons depending on their size), he is so strong that he is capable of ripping off the arm of the likes of Darkseid and physically defeating him in combat,he has been able to move the planet Earth away from the Sun while a powerful Cosmic Entity, Starbreaker was pushing it toward the Sun, he is so strong he possesses the strength necessary shatter entire worlds. Superman has been chained to the endless wheels of the Mageddon machinery and his strength was used to move the gears of a weapon whose size dwarfed the entire Earth/Moon system itself. He can become 'supercharged' and exceed his 'normal' power levels as evident when his power absorption ability ran amok which needed the Parasite to drain off his excessive power levels.<br><strong>Invulnerability:</strong><br>Superman's body is nigh-invulnerable. This ability's levels have changed over time. He has taken a blast equivalent to a million nuclear war heads point blank and remained conscious. Currently he is even more durable than in the past. He has entered the Sun and emerged completely unharmed, he has even traveled through Krypton's Red Sun and survived physically unharmed, even though Red Solar Radiation depowers and weakens him. He has been seen to skirt the photosphere of the sun (100,000,000 degrees F). Superman has even been shown withstanding Darkseid's Omega Beams, a feat that was previously considered impossible. Superman was able to survive the nuclear destruction of the entire moon in the year 2995 when he was stuck in the future. The moon had been lined with sufficient nuclear devices to disintegrate it in one shot and Superman was in the center and survived without being hurt at all. Superman has withstood 3 particle beams, each powered by the core of a planet, fired at him. One of these planet-powered beams was a plasma beam capable of leveling a huge city a few times over entirely with a single blast. Most likely his greatest feat of durability recently, is that he was recently able to withstand the destructive power of a Sun exploding and going Nova (A result of Brainiac's technology.) at point blank range to the planet he was on (Which was eradicated by the force of the explosion with the rest of the surrounding system.) and survived without any visible physical damage although the explosion did knock him out. In addition, his immune system protects him from all toxins and diseases. The most common explanations for his invulnerability are Superman having a super-dense molecular structure and/or a supercharged bio electric 'aura' which acts as an invisible 'force field' around his body within a few millimeters from his skin, and presumably within his body as well. The proximity of this field to his skin means that loose clothes, for example, may be burned off of him, while cloth that is close to his body is protected by the 'aura;' This phenomenon is sometimes cited as Superman's reason for wearing a skin-tight bodysuit. It is sometimes implied that he can unconsciously extend this field to an undetermined extent to protect a greater area, allowing him to carry huge objects within the Earth's atmosphere and without gravity or inertia tearing them apart around his human-sized hands.<br><strong>Longevity:</strong><br>Superman can live almost indefinitely.<br><strong>Superhuman Stamina:</strong><br>Superman has the ability to maintain continuous strenuous physical action for an undefined period. Theoretically, most incarnations of the character has unlimited stamina as his enhanced nourishment is produced from the solar energy his cells process. Superman like other Kryptonians does not get tired and does not need to eat or sleep and can be sustained on Solar energy alone. He can also hold his breath for an undefined duration.<br><strong>Flight:</strong></br>Under one Earth gravity Superman is capable of flying at faster than light speeds. He tends to fly at speeds of Mach 10 in the atmosphere. His control of his flight is perfect and he can perform aerobatic feats such as hovering, flying backwards and even lifting great weights while flying. Superman can fly at speeds many times faster than light..Superman has the ability to fly in outer space. He has been seen to fly to the moon in minutes so we can assume that he can fly faster than that outside of atmospheric interference."
}